CSI API ETABS v1

# cDesignResults Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDesignResults

    Public Interface cDesignResults

    Dim instance As cDesignResults

    public interface class cDesignResults

    type cDesignResults =  interface end

The cDesignResults type exposes the following members.

Properties

| Name| Description
---|---|---
|
DesignForces|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com